Repository: jesusrmx/lazgitgui
Catalog: languages/lazgitgui.*.po
Languages: es

# main.rsnewbranch
source: New Branch
es: Nueva Rama

# main.rsnewtag
source: Create a tag at this point
es: Crear etiqueta aquí

# main.rspushingyourcommits
source: Pushing your commits
es: Subiendo tus cambios

# main.rsreload
source: Reload
es: Actualizar

# main.rsrestoringworkfiles
source: Restoring working files
es: Restaurando archivos de trabajo

# main.rsrestoringworkfileswarning
source: You are about to discard changes in %s, data will be lost and this action cannot be undone Are you sure to continue?
es: Estas por desechar los cambios en %s, La información se perderá y esta acción no se puede deshacer ¿Aún deseas continuar?

# main.rstherearecommitsbehind
source: There are commits behind, are you sure you want to push?
es: Hay cambios remotos sin integrar, ¿Estás seguro de subir los cambios locales?

source: Go to child
es: Ir al hijo de esta revisión

source: Go to head
es: Ir a la revisión actual

source: Go to Parent
es: Ir al padre de esta revisión

# tframelog.btnstop.caption
source: Stp
es: Detener

# tframelog.gridlog.columns[0].title.caption
source: RecNo
es: Núm

# tframelog.gridlog.columns[1].title.caption
source: Graph
es: Gráfico

# tframelog.gridlog.columns[2].title.caption
source: Subject
es: Mensaje

# tframelog.gridlog.columns[3].title.caption
source: Author
es: Autor

# tframelog.gridlog.columns[4].title.caption
source: Date
es: Fecha

# tframelog.lblinfo.caption
source: Working ....
es: Procesando ....

source: Copy
es: Copiar

source: All info
es: Toda la información

source: Patch
es: Parche

source: Tree
es: Archivos

source: Check out a Tag
es: Cargar una etiqueta

source: Create a branch.
es: Crear rama.

source: tag
es: etiqueta

source: Branch Name:
es: Rama:

source: Custom Commands
es: Comandos del usuario

source: Ask confirmation before excution.
es: Pedir confirmación antes de ejecutar.

source: Run in a dialog window.
es: Ejecutar en una ventana.

source: Rescan after execution.
es: Actualizar después de ejecutar.

source: Command properties
es: Propiedades del comando

source: Command (make sure it starts with 'git')
es: Comando (asegúrese de comience con 'git')

source: Command
es: Comando

source: Command description
es: Descripción del comando

source: Description
es: Descripción

source: Image filename
es: Archivo de imagen

# tfrmfilehistory.grid.columns[0].title.caption
source: Date
es: Fecha

# tfrmfilehistory.grid.columns[1].title.caption
source: Author
es: Autor

# tfrmfilehistory.grid.columns[2].title.caption
source: Subject
es: Mensaje

# tfrmfilehistory.grid.columns[3].title.caption
source: Commit
es: Identificador

source: frmLog
es: Historial

# tfrmlog.flog.gridlog.columns[0].title.caption
source: RecNo
es: Núm

# tfrmlog.flog.gridlog.columns[1].title.caption
source: Graph
es: Gráfico

# tfrmlog.flog.gridlog.columns[2].title.caption
source: Subject
es: Mensaje

# tfrmlog.flog.gridlog.columns[3].title.caption
source: Author
es: Autor

# tfrmlog.flog.gridlog.columns[4].title.caption
source: Date
es: Fecha

source: Add a custom command
es: Agregar un comando de usuario

# tfrmmain.actcommit.caption
source: Commit
es: Confirmar

source: Insert Branch Name
es: Insertar Nombre de Rama

source: Quit
es: Salir

source: Rescan
es: Actualizar

source: Restore Commit Msg
es: Restaurar Mensaje

source: Branch:
es: Rama:

source: Upstream:
es: Origen:

source: Tag:
es: Etiqueta:

source: File
es: Archivo

source: Modified, Not Staged.
es: Modificado, No Preparado.

source: Staged Changes (will commit)
es: Cambios Preparados (a confirmar)

source: Unstaged Changes
es: Cambios No Preparados

source: Create a new branch
es: Crear nueva rama

source: Fetch Tracked Branch
es: Obtener (fetch) cambios remotos

source: Switch to the new branch
es: Cambiar a la nueva rama

# tfrmnewbranch.label1.caption
source: Options
es: Opciones

# tfrmnewbranch.label2.caption
source: Name
es: Nombre

source: Custom Options
es: Opciones

source: New tag
es: Nueva etiqueta

source: Annotated tag.
es: Etiqueta con propiedades.

# tfrmnewtag.label1.caption
source: Name
es: Nombre

source: Message:
es: Mensaje:

source: Reset branch
es: Restaurar rama

source: You are reset
es: Estas restaurando

source: Reset Type
es: Tipo de restauración

source: frmRunCommand
es: Ejecutar comando

source: Close on Succeed
es: Cerrar en caso de ejecución exitosa

# unitcommon.rsaddsfilestoignorelist
source: Add '*%s' Files to ignore list
es: Añadir los archivos '*%s' a la lista de ignorados

# unitcommon.rsaddstoignorelist
source: Add '%s' to ignore list
es: Añadir '%s' a la lista de ignorados

# unitcommon.rsattag
source: At tag
es: En la etiqueta

source: Branch name already exists
es: El nombre de rama ya existe

source: Branch name is empty
es: Nombre de rama vacío

source: Branch '%s' alredy exists
es: La rama '%s' ya existe

source: Building graph..
es: Construyendo gráfico ...

# unitcommon.rscancel
source: Cancel
es: Cancelar

source: command %d: %s
es: comando %d: %s

source: Command must start with 'git '
es: El comando debe comenzar con 'git '

# unitcommon.rscommit
source: Commit
es: Revisión

source: Commit: %s
es: Revisión: %s

# unitcommon.rscouldntgettopleveldirectoryofs
source: Couldn't get toplevel directory of %s
es: No pude obtener el directorio base de %s

source: Create a branch at this commit
es: Crear una rama en esta revisión

source: Create a tag at this commit
es: Crear una etiqueta en esta revisión

# unitcommon.rsdcommitsahead
source: %d commits ahead
es: %d revisiones por delante

# unitcommon.rsdcommitsbehind
source: %d commits behind
es: %d revisiones detrás

# unitcommon.rsdcommitssince
source: %d commits since
es: %d revisiones desde

source: Delete branch %s
es: Eliminar rama %s

source: Delete remote branch %s
es: Eliminar rama remota %s

source: Delete tag %s
es: Eliminar etiqueta %s

source: Deleting remote branch
es: Eliminar rama remota

source: Description is empty
es: La descripción esta vacía

# unitcommon.rsdfiles
source: %d files
es: %d archivos

# unitcommon.rsdiscardchanges
source: Discard changes
es: Desechar cambios

# unitcommon.rsdoyouwanttopushstosa
source: Do you want to push "%s" to "%s" and setup tracking information? I will do: git push --set-upstream %1:s %0:s
es: ¿Quieres subir "%s" a "%s" y configurar información de seguimiento? Ejecutaré: git push --set-upstream %1:s %0:s

source: Error while getting list of branches
es: Error mientras se obtenía la lista de ramas

# unitcommon.rsexecutingacustomcommand
source: Executing a custom command
es: Ejecutando un comando de usuario

source: Failed
es: Ha fallado

# unitcommon.rsfetchingfromremote
source: Fetching from remote:
es: Obteniendo cambios (fetch) del origen:

source: History of %s
es: Historial de %s

source: Incomplete command
es: Comando incompleto

source: Invalid
es: Inválido

source: Invalid character in branch name
es: Carácter inválido en nombre de rama

source: Invalid character in tag name
es: Carácter inválido en nombre de etiqueta

source: Invalid description
es: Descripción inválida

source: Local Branches
es: Ramas locales

source: Merge %s to %s
es: Fusionar %s con %s

# unitcommon.rsmerging
source: MERGING
es: FUSIÓNANDO

source: Merging branches
es: Fusionando ramas

# unitcommon.rsmergingconflict
source: MERGING CONFLICT
es: FUSIÓN CON CONFLICTOS

# unitcommon.rsnewbranch
source: New Branch
es: Nueva Rama

# unitcommon.rsnewtag
source: Create a tag at this point
es: Crear etiqueta aquí

source: No commit set
es: Falta Id revisión

source: No refering branch selected
es: No se ha seleccionado rama de referencia

source: No refering tag selected
es: No se ha seleccionado etiqueta de referencia

# unitcommon.rsnotagavailable
source: No Tag available
es: No hay etiqueta

source: Not refers to a tracking branch
es: No se refiere a una rama de seguimiento

# unitcommon.rsnotyetimplementedforstageds
source: Not yet implemented for Staged: %s
es: Aún no implementado para Preparados: %s

# unitcommon.rsnotyetimplementedforunstageds
source: Not yet implemented for Unstaged: %s
es: Aún no implementado para No Preparados: %s

# unitcommon.rsof
source: of
es: de

# unitcommon.rspullingfromremote
source: pulling from remote:
es: Traer del origen remoto

# unitcommon.rspushingbranchwithout
source: Pushing branch without tracking information
es: Subiendo rama sin información de seguimiento

# unitcommon.rspushingtoremotes
source: Pushing to remote: %s
es: Subiendo al destino remote: %s

# unitcommon.rspushingyourcommits
source: Pushing your commits
es: Subiendo tus cambios

# unitcommon.rsreload
source: Reload
es: Actualizar

source: Reset a branch
es: Restaurar rama

source: Reset branch %s
es: Restaurar rama %s

source: Reset index and working copy. LOCAL CHANGES WILL BE LOST! git doc: Resets the index and working tree. Any changes to tracked files in the working tree since <commit> are discarded. Any untracked files or directories in the way of writing any tracked files are simply deleted.
es: Restaurar el Índice y la copia de trabajo. ¡LOS CAMBIOS LOCALES SE PERDERÁN! git doc: Resets the index and working tree. Any changes to tracked files in the working tree since <commit> are discarded. Any untracked files or directories in the way of writing any tracked files are simply deleted.

source: Reset index, don't touch working copy. git doc: Resets the index but not the working tree (i.e., the changed files are preserved but not marked for commit) and reports what has not been updated. This is the default action.
es: Restaurar el Índice, no toca la copia de trabajo. git doc: Resets the index but not the working tree (i.e., the changed files are preserved but not marked for commit) and reports what has not been updated. This is the default action.

source: Neither the working copy nor the index are altered. git doc: Does not touch the index file or the working tree at all (but resets the head to <commit>, just like all modes do). This leaves all your changed files "Changes to be committed", as git status would put it.
es: No se altera el Índice ni la copia de trabajo.. git doc: Does not touch the index file or the working tree at all (but resets the head to <commit>, just like all modes do). This leaves all your changed files "Changes to be committed", as git status would put it.

source: Reset %s to this commit
es: Restaurar %s a esta revisión

# unitcommon.rsrestoreallchanged
source: Restore All Changed
es: Restaurar todo lo que haya cambiado

# unitcommon.rsrestores
source: Restore '%s'
es: Restaurar '%s'

# unitcommon.rsrestoringworkfiles
source: Restoring working files
es: Restaurando archivos de trabajo

# unitcommon.rsrestoringworkfileswarning
source: You are about to discard changes in %s, data will be lost and this action cannot be undone Are you sure to continue?
es: Estas por desechar los cambios en %s, La información se perderá y esta acción no se puede deshacer ¿Aún deseas continuar?

# unitcommon.rssdoesnotexists
source: %s does not exists
es: %s no existe

# unitcommon.rsshasnotrackingandthere
source: %s has no tracking and there are %d remotes (%s) I'm not yet prepared to handle this
es: %s no tiene información de seguimiento y hay %d destinos remotos (%s) Aún no se como manejar esta situación

# unitcommon.rssisalreadyinignoredlist
source: '%s' is already in ignored list
es: '%s' ya esta en la lista de ignorados

# unitcommon.rsstageall
source: Stage All
es: Prepara todo

# unitcommon.rsstagechanged
source: Stage Changed
es: Prepara los modificados

# unitcommon.rsstages
source: Stage '%s'
es: Prepara '%s'

source: Starting command, please wait ....
es: Comenzando comando, por favor espere ....

source: Succeed
es: Éxito

source: Switch to %s
es: Cambiar a %s

source: Switch to tag %s
es: Cambiar a la etiqueta %s

source: Tag name is empty
es: El nombre de la etiqueta esta vacío

source: Tags
es: Etiquetas

source: Tag: %s
es: Etiqueta: %s

# unitcommon.rsthefilesisbinarydbytes
source: The file '%s' is binary, %d bytes
es: El archivo '%s' es binario, tiene %d bytes

# unitcommon.rstherearecommitsbehind
source: There are commits behind, are you sure you want to push?
es: Hay cambios remotos sin integrar, ¿Estás seguro de subir los cambios locales?

# unitcommon.rsthetypesisalreadyintheignoredlist
source: The type '*%s' is already in the ignored list
es: El tipo de archivo '*%s' ya esta en la lista de ignorados

# unitcommon.rsthisfeaturewillbeimplementedasap
source: This feature will be implemented ASAP
es: Esta función se implementará pronto

# unitcommon.rsthisrepositoryhasnoremotes
source: This repository has no remotes defined I'm not yet prepared to handle this
es: Este repositorio aún no ha definido fuentes remotas Aún no se como manejar esta situación

source: Tracking Branches
es: Ramas con seguimiento

source: Unable to locate db index
es: No es posible localizar el índice de db

# unitcommon.rsunstageall
source: Unstage All
es: Des preparar Todo

# unitcommon.rsunstages
source: Unstage '%s'
es: Des preparar '%s'

# unitcommon.rsviewignoredfiles
source: View Ignored Files
es: Mostrar Archivos Ignorados

# unitcommon.rsviewtrackedfiles
source: View Tracked Files
es: Mostrar Archivos con Seguimiento

# unitcommon.rsviewuntrackedfiles
source: View Untracked Files
es: Mostrar Archivos sin Seguimiento

source: will do: git checkout -b %s %s
es: Haré: git checkout -b %s %s

source: will do: git checkout %s Repo will be left in detached HEAD state
es: Haré: git checkout %s El repositorio quedará con HEAD desconectado

# unitcommon.rsworking
source: Working ....
es: Procesando ....

source: worktree: %s
es: árbol de trabajo: %s

# unitcommon.rsyesdoit
source: yes, do it
es: Sí, hazlo

# unitcommon.rsyouareabouttoexecute
source: You are about to execute %s: command: %s Do you want to proceed?
es: Estás a punto de ejecutar %s: comando: %s ¿Quieres proceder?

source: You are resetting branch %s to revision %s: %s Do you want to proceed?
es: Estás restaurando %s a la revisión %s: %s ¿Quieres proceder?

# unitcommon.rsyouhavetostagesomething
source: You have to stage something in order to commit
es: Tienes que preparar algo para poder confirmar los cambios.

# unitcommon.rsyourcommitmessageisempt
source: Your commit message is empty!
es: ¡El mensaje de confirmación esta vacío!

source: File state missing description
es: Estado de archivo sin descripción

source: File type changed, not staged
es: Cambió el tipo de archivo. No preparado

source: File type changed, old type staged for commit
es: Cambió el tipo de archivo, tipo anterior preparado para confirmar

source: File type changed, staged
es: Cambió el tipo de archivo. Preparado

source: File type change staged, Missing
es: Preparado el cambio en tipo de archivo. Pero no hallado.

source: File type change staged, Modification not staged
es: Cambio en tipo de archivo ya preparada. Modificaciones sin preparar

source: Ignored
es: Ignorados

source: Missing
es: No hallado

source: Modified, not staged
es: Modificado, no preparado

source: Portions staged for commit
es: Preparadas porciones para confirmar

source: Requires merge resolution
es: Requiere resolución de fusión

source: Staged for commit
es: Preparado para confirmar

source: Staged for commit, missing
es: Preparado para confirmar, no hallado

source: Staged for removal
es: Preparado para su eliminación

source: Staged for removal, still present
es: Preparado para su eliminación, aún existe.

source: Staged for Rename
es: Preparado para cambio de nombre

source: Unmerged, Added by Them
es: Sin fusionar, Agregado por Ellos

source: Unmerged, Added by Us
es: Sin fusionar, Agregado por Nosotros

source: Unmerged, Both added
es: Sin fusionar, Agregado por ambos

source: Unmerged, Both deleted
es: Sin fusionar, Eliminado por ambos

source: Unmerged, Both Modified
es: Sin fusionar, Modificado por ambos

source: Unmerged, Deleted by Them
es: Sin fusionar, Eliminado por Ellos

source: Unmerged, Deleted by Us
es: Sin fusionar, Eliminado por Nosotros

source: Unmodified
es: Sin modificar

source: Untracked, not staged
es: Sin seguimiento, no preparado
